# 内容书写方向
WRITING_MODE = (
    ('h', '横排'),
    ('v', '竖排'),
)

# 内容阅读方向
READING_MODE = (
    ('lr', '左到右'),
    ('rl', '右到左'),
)

# 内容状态，即为 Article status
CONTENT_STATUS = (
    ('unaudit', '待校对'),  # 所有内容入库默认为待校对
    ('auditing', '校对中'),
    ('release', '内容发布'),  # 校对完成后，即为发布状态
    ('forbid', '内容隐藏'),
)

# DEPRECATED 内容展示状态，合并到 CONTENT_STATUS
OPEN_STATUS = (
    ('open', '开放'),
    ('close', '隐藏'),
)

# 审核状态
AUDIT_STATUS = (
    ('unassign', '未分配'),
    ('unaudit', '待校对'),
    ('success', '成功'),
    ('fail', '失败'),
    ('returned', '驳回'),
    ('suspend', '挂起')
)

# 质检类型
QA_TYPE = (
    ('no_qa', '一键放通'),
    ('sample', '抽样质检'),
)

# 审核订单状态
AUDIT_ORDER_STATUS = (
    ('1100', '一审未分配'),
    ('1101', '一审待校对'),
    ('1102', '一审成功'),
    ('1103', '一审驳回'),  # NOTE 作为第一次审核，目前是没有驳回的需求
    ('1104', '一审失败'),
    ('1105', '一审挂起'),
    ('1200', '二审未分配'),
    ('1201', '二审待校对'),
    ('1202', '二审成功'),
    ('1203', '二审驳回'),
    ('1204', '二审失败'),
    ('1205', '二审挂起'),
    ('2100', '质检未分配'),
    ('2101', '质检待审核'),
    ('2102', '质检成功'),  # NOTE 2102 质检成功作为校对流程最后一个状态
    ('2103', '质检驳回'),  # TODO 预留以后使用，可作为三方交付的状态
    ('2104', '质检失败'),  # TODO 预留以后使用，可作为三方交付的状态
    ('2105', '质检挂起'),  # TODO 预留以后使用，可作为三方交付的状态
)

# 绩效类型
KPI_TYPES = (
    ('content_hor', '内容横排'),
    ('content_ver', '内容竖排'),
    ('order_returned_shuffle', '校对驳回'),
)

# 绩效统计所在流程
KPI_TRIGGER_STEPS = (
    ('first_audit', '一审'),
    ('second_audit', '二审'),
    ('qa', '质检'),
)
